N,M = map(int, input().split())
graph = [list(map(int, input().split())) for _ in range(N)]

# [행, 열]
tetromino = [
    # I (2)
    [[0,0,0,0],[0,1,2,3]],
    [[0,1,2,3],[0,0,0,0]],

    # O (1)
    [[0,0,1,1],[0,1,0,1]],

    # T (4)
    [[0,0,0,1],[0,1,2,1]],              # T 위
    [[0,1,1,1],[1,0,1,2]],              # T 아래
    [[0,1,1,2],[0,0,1,0]],              # T 왼
    [[0,1,1,2],[1,1,0,1]],              # T 오른

    # S (2)
    [[0,0,1,1],[1,2,0,1]],              # S 가로
    [[0,1,1,2],[0,0,1,1]],              # S 세로

    # Z (2)
    [[0,0,1,1],[0,1,1,2]],              # Z 가로
    [[0,1,1,2],[1,1,0,0]],              # Z 세로

    # L (4)
    [[0,1,2,2],[0,0,0,1]],              # L 기본
    [[0,0,0,1],[0,1,2,0]],              # L 회전
    [[0,0,1,2],[0,1,1,1]],              # L 회전
    [[0,1,1,1],[2,0,1,2]],              # L 회전

    # J (4)
    [[0,1,2,2],[1,1,1,0]],              # J 기본
    [[0,1,1,1],[0,0,1,2]],              # J 회전
    [[0,0,1,2],[0,1,0,0]],              # J 회전 
    [[0,0,0,1],[0,1,2,2]],              # J 회전
]

result = 0

for i in range(N):
    for j in range(M):
        for drs, dcs in tetromino:
            s = 0
            ok = True
            for k in range(4):
                nr = i + drs[k]
                nc = j + dcs[k]
                if 0 <= nr < N and 0 <= nc < M:
                    s += graph[nr][nc]
                else:
                    ok = False
                    break
            if ok and s > result:
                result = s

print(result)